{
  "2025": [
    "Wang, Jun-You, Yu-Chia Kuo, and Li Su. 2025. “Improving Motif Discovery of Symbolic Polyphonic Music with Motif Note Identification.” Transactions of the International Society for Music Information Retrieval 8 (1). https://transactions.ismir.net/articles/10.5334/tismir.250",
    "Kun Fang, Kyrie Bouressa, Yu-Chia Kuo, Anna de Bakker, and Ichiro Fujinaga. 2025. “Universal Musical Instrument Lexicon: A Crowdsourced Platform for Expanding Multilingual Vocabularies and Enhancing Global Access to Musical Instrument Metadata.” Poster accepted by 12th International Conference on Digital Libraries for Musicology, Sogang University, Seoul, South Korea.",
    "Yu-Chia Kuo, Sin-Yu Deng, and Tak-Cheung Hui. 2025. “Seascape Serenity: Unveiling the Underwater Soundscape.” In International Computer Music Conference. (In press) https://drive.google.com/file/d/1xEVDE63kPeoUVNGVFWgiL136vRAw5iuZ/view",
    "Hui, Tak Cheung, Xiaoqiao Li, and Yu-Chia Kuo. 2025. “Turntable-Based Electronic Music and Embodied Audience Interaction.” Proceedings of the International Conference on New Interfaces for Musical Expression (Canberra, Australia), June, 121–25. https://doi.org/10.5281/zenodo.15699598."

  ],
  "2024": [
    "Hui, Tak Cheung, and Yu Chia Kuo. 2024. “Tale of Tales: Interdisciplinary Art at the Intersection of Music, History, Sugar, and Technology.” SIGGRAPH Asia 2024 Art Papers (New York, NY, USA), SA ’24. https://doi.org/10.1145/3680530.3695449.",
    "Hui, Tak-Cheung, and Yu-Chia Kuo. 2024. “A Concert in a Vanished Church: Contextualizing Peace Island’s Auditory History with Modern Technology.” Proceedings of the ACM on Computer Graphics and Interactive Techniques 7 (4): 1–9. https://doi.org/10.1145/366421.",
    "Hung, Tzu-Yun, Jui-Te Wu, Yu-Chia Kuo, Yo-Wei Hsiao, Ting-Wei Lin, and Li Su. 2024. “A Study on Synthesizing Expressive Violin Performances: Approaches and Comparisons.” International Conference on Technologies and Applications of Artificial Intelligence, 3–16. https://arxiv.org/abs/2406.18089.",
    "Zih-Syuan Lin*, Yu-Chia Kuo*, Tzu-Yun Hung, et al. 2024. “S3: A Symbolic Music Dataset for Computational Music Analysis of Symphonies.” Paper presented at Extended Abstracts for the Late Breaking Demo Session of the 25th Int. Society for Music Information Retrieval Conference, San Francisco, United States. November 14. https://ismir2024program.ismir.net/lbd_463.html.",
    "Huang, Yu-Fen, Nikki Moran, Simon Coleman, et al. 2024. “MOSA: Music Motion with Semantic Annotation Dataset for Cross-Modal Music Processing.” IEEE/ACM Transactions on Audio, Speech, and Language Processing."
  ]
}
